public/man/man1/git-unpack-objects.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - git-unpack-objects.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - git-unpack-objects.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>git-unpack-objects - Unpack objects from a packed archive</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<pre class="example">
git unpack-objects [-n] [-q] [-r] [--strict]
</pre>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Read a packed archive (.pack) from the standard input, expanding the
objects contained within and writing them into the repository in &#34;loose&#34;
(one object per file) format.</p>
<p>
Objects that already exist in the repository will <strong>not</strong> be unpacked from
the packfile. Therefore, nothing will be unpacked if you use this
command on a packfile that exists within the target repository.</p>
<p>
See *git-repack*(1) for options to generate new packs and replace
existing ones.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>-n</p>
<blockquote>
<p>Dry run. Check the pack file without actually unpacking the objects.</p>
</blockquote>
<p>
-q</p>
<blockquote>
<p>The command usually shows percentage progress. This flag suppresses it.</p>
</blockquote>
<p>
-r</p>
<blockquote>
<p>When unpacking a corrupt packfile, the command dies at the first
corruption. This flag tells it to keep going and make the best effort to
recover as many objects as possible.</p>
</blockquote>
<p>
–strict</p>
<blockquote>
<p>Don&#39;t write objects with broken content or links.</p>
</blockquote>
<p>
–max-input-size=&lt;size&gt;</p>
<blockquote>
<p>Die, if the pack is larger than &lt;size&gt;.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
GIT
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>Part of the *git*(1) suite</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
